text_welcome_1 = '''Привет! Я твой личный мотиватор, помогу тебе не потерять твою мотивацию на день! Вперёд к новым свершениям! Вместе мы со всем справимся!
Чтобы начать, расскажи как у тебя дела?'''
text_welcome = [text_welcome_1]
image_welcome = '13200873/d14a3aa6132ee9572acf'
button_description = 'Что ты умеешь делать?'
button_interesting_fact = 'Расскажи что-нибудь интересное'
buttons_welcome = [
    {'text': button_description, 'hide': True},
    {'text': button_interesting_fact, 'hide': True}
]

text_description_1 = '''Моя главная задача - мотивировать тебя при любой возможной встрече на просторах голосового помощника Алиса! Вместе мы всё сможем!
Чтобы начать, расскажи как у тебя дела?'''
text_description = [text_description_1]
image_description = '1540737/44060c0f472224366623'

text_interesting_fact_1 = '''Мотивация — это внутреннее состояние человека, которое побуждает его к действию и достижению определённых целей. Стремление — это активное желание достичь чего-либо, например, успеха, признания или самореализации.
Вот несколько интересных фактов о мотивации и стремлении:
Внутренняя мотивация — это когда человек действует исходя из своих внутренних причин и ценностей, а не из внешних обстоятельств.
Базовые потребности, такие как принятие, любознательность, семья и честь, лежат в основе мотивации'''
text_interesting_fact = [text_interesting_fact_1]
image_interesting_fact = '997614/adb1e9004c45376ee2b4'

text_all_good_1 = '''И это прекрасно! Если будут какие-то проблемы с настроением или мотивацией. Да может просто грустно стало, то заходи сюда, пообщаемся!) Всегда рада твоему появлению!)'''
text_all_good_2 = '''Хорошо, что у тебя всё хорошо'''
text_all_good = [text_all_good_1, text_all_good_2]
image_all_good = '1540737/91a1a752bc6b8aeff2eb'

text_scene_1 = '''Не волнуйся, выступления не являются чем-то серьезным и страшным. Чтобы справиться с волнением перед выступлением попробуй проделать следующие действия: практикуйся, тренируйся перед зеркалом, практикуйте глубокое дыхание и улыбку, чтобы успокоиться и создать атмосферу доверия.
Для уверенности в себе повторите перед сном свой заготовленный текст и хорошенько выспитесь!)
«Современная аудитория - будь то пятнадцать человек на деловом совещании или тысяча человек под тентом - хочет, чтобы оратор говорил так же просто, как и в личной беседе, и вообще в той манере, как будто он беседует с одним человеком.» (Дейл Карнеги)'''
text_scene = [text_scene_1]
image_scene = '213044/78af6ac33e7273f59c43'

text_stress_1 = '''Да, стресс такое неприятное чувство. Попробуйте отвлечься от стресса,
подумать о чём-то приятном и связанном с положительными эмоциями.
Для борьбы со стрессом можно использовать следующие методы:
Отвлечение от стрессовой ситуации: сосредоточьтесь на приятных и позитивных моментах.
Снижение субъективной значимости события: пересмотрите своё отношение к ситуации и найдите положительные стороны.
Активное поведение: выразите свои эмоции через физическую активность или занятие любимым делом.
Умение расслабляться: практикуйте техники релаксации, такие как глубокое дыхание, медитация или мышечное расслабление.
Позитивное мышление: развивайте позитивное отношение к жизни и стремитесь видеть положительные стороны в любых ситуациях.
«Любой стресс — это инструмент. С помощью него человек может понять, что
нужно ценить всё, что уже есть. Каждая личность обладает потенциалом,
который помогает преодолевать даже самые сложные жизненные ситуации» — Киану Ривз'''
text_stress = [text_stress_1]
image_stress = '1030494/78bfc54f76139850efc3'

text_sad_situation_1 = '''Я понимаю. Иногда бывает так грустно, что даже словами не описать.
Вот несколько способов, которые помогут справиться с грустью:
совершите добрый поступок;
переключитесь на другое занятие;
займитесь смелыми поступками;
порадуйте себя;
выразите свои эмоции;
увидьтесь с друзьями;
настройте себя на успех;
займитесь спортом;
найдите положительные моменты в сложной ситуации;
доводите дела до конца.
Вспомните, что у вас есть близкие, друзья, подруги, которые бы не хотели, чтобы вы расстраивались!)
«Воспринимать трудности, неудачи и печали в жизни как вызов, принимая и парируя который мы становимся сильнее, а не как несправедливое наказание, которого мы не заслуживаем, — это требует веры и мужества» (Эрих Фромм).'''
text_sad_situation = [text_sad_situation_1]
image_sad_situation = '997614/c2936295306d7b3b9195'

text_all_annoing_1 = '''Вы в очередной раз поймали себя на негативной мысли? Не отчаивайтесь! Примерно 50% наших мыслей содержат негативные моменты. Они составляют неотъемлемую часть нашей психологии. К счастью, есть способы, которые помогут вам выработать позитивный взгляд на мир.
Сначала примите негатив: признайте, что негативные эмоции — это естественная часть человеческой жизни. Они не делают вас плохим, а помогают оставаться личностью. Анализируйте причины: поймите, что у вас вызывает негативные эмоции. Замените негативные мысли позитивными, как бы это банально не звучало: составьте список неприятных вещей, которые вы говорите себе, и запишите рядом с ними нейтральные или позитивные высказывания, которые их опровергают. Контроль: если негатив вызван вещами, которые вы не можете контролировать, переключите внимание на то, что поддается вашему контролю. Говорите себе: “Да, сейчас я чувствую себя рассерженным”, “Да, я испытываю разочарование”. Это поможет высвободить негативные эмоции. Не сопротивляйтесь: чем больше вы стараетесь подавить их, тем больше о них думаете. Следуя этим шагам, вы сможете научиться управлять негативными эмоциями здоровым образом, что поможет вам быть довольным жизнью.
«Я просто больше смеюсь, потому что это хорошая разрядка, — через смех ты освобождаешься от всего негатива» Анджелина Джоли.'''
text_all_annoing = [text_all_annoing_1]
image_all_annoing = '1540737/81f4c49101aee8492826'

text_loss_of_inspiration_1 = '''Да, его не всегда легко найти. Но вы только начните, а там, глядишь, и само придёт.
К примеру, вдохновение можно найти в разных источниках:
Наблюдайте за природой, исследуйте уличную архитектуру и изучайте культурные и художественные произведения.
Общайтесь с коллегами, участвуйте в мастер-классах и выставках, чтобы видеть работы других художников и получать новые идеи.
Ищите вдохновение в своих интересах, страстях, внутренних переживаниях и эмоциях.
Экспериментируйте и будьте открыты к новым идеям.
Эти способы однозначно помогут пробудить в вас вдохновение. А если нет, то может чашечка натурального кофе взбодрит вас и даст идея для вдохновения? Попробуйте разные способы!)
"Нет единственного источника вдохновения. Настоящий источник — это моё мировоззрение, принципы, которыми я руководствуюсь в жизни" (Джорджио Армани)'''
text_loss_of_inspiration = [text_loss_of_inspiration_1]
image_loss_of_inspiration = '1521359/c6fba51b336bd760eaaa'

text_no_motivation_1 = '''Чтобы поднять мотивацию, попробуйте сосредоточиться на своих целях и наградах, которые вас ждут в случае успеха. Также можно окружить себя позитивными людьми и заниматься любимыми делами, которые приносят вам радость и удовлетворение!)
Будьте терпеливы: помните, что мотивация может колебаться, и это нормально. Важно продолжать двигаться вперёд и верить в себя!)
"Помните почему вы начали" – Эрин Янус'''
text_no_motivation = [text_no_motivation_1]
image_no_motivation = '997614/2b9721ae20d108161ee9'
button_1 = 'Попробуй отвлечься'
button_2 = 'Вспомни почему важно это сделать'
button_3 = 'Попробуй разделить одну задачу на несколько маленьких'
buttons_no_motivation = [
    {'text': button_1, 'hide': False},
    {'text': button_2, 'hide': False},
    {'text': button_3, 'hide': False}
]


text_confidence_1 = '''Стать морально сильнее под силу каждому человеку. Вам стоит следовать этим кратким шагам:

1)Принимайте неопределенность и оставляйте время для спонтанных действий. Начинайте с
небольших временных промежутков и постепенно увеличивайте их.
2) Сравнивайте себя только с собой прошлым. В конце каждой недели отмечайте свои достижения и прогресс.
3) Наслаждайтесь самим путем к цели, а не только конечным результатом.
4) Ведите список своих достижений, чтобы помнить и ценить свои успехи.
5) Не спешите действовать при неприятностях: Дайте себе время прочувствовать и осмыслить негативные эмоции, не пытайтесь сразу их подавлять.

Следуя этим шагам, вы сможете укрепить свою моральную устойчивость и лучше справляться с жизненными трудностями. «Большая воля — это не только умение чего-то пожелать и добиться, но и
умение заставить себя отказаться от чего-то, когда это нужно» (А.С.
Макаренко).'''
text_confidence = [text_confidence_1]
image_confidence = '1652229/fee0ec4c8566d8031a7e'

text_low_self_esteem_1 = '''Если у вас низкая самооценка, важно предпринять шаги для повышения уверенности в себе. Вот несколько советов:

1)Говорите себе поддерживающие слова. Вместо негативных, таких как “Я ничего не умею”, попробуйте переформулировать их в позитивные, например, “Я многое умею, у меня получится”.
2)Примите себя таким, какой вы есть. Каждый человек уникален!
3)Выходите из зоны комфорта для преодоления своих страхов, это поможет вам расширить свои горизонты.
4)Общайтесь только с теми, кто вас поддерживает, уважает и любит.
5)Уделяйте внимание своему физическому и эмоциональному здоровью.
6)Учитесь говорить “нет”. Уважайте свои потребности,  это укрепит ваши личные границы и повысит самооценку.
7)Если чувствуете, что не справляетесь, то обратитесь к специалисту.

Верьте в себя! У вас всё точно получится! Обнимаю и поддерживаю вас!) «Ты сама не знаешь, какая ты замечательная. Как только ты поверишь в себя, ты сможешь справиться с любыми сложностями на свете» — Уилл Олсон.'''
text_low_self_esteem = [text_low_self_esteem_1]
image_low_self_esteem = '997614/97c686113b2190ae61e9'

text_success_1 = '''Чтобы достичь успеха, важно следовать нескольким правилам, которые помогут вам добиться своих целей и получать удовольствие от самого процесса.

Думайте о процессе, путь к успеху состоит из множества этапов, каждый из которых необходимо пройти. Начните что-то делать, даже если боитесь ошибиться. Ошибки - часть успеха. Чаще говорите “да” новым возможностям. Лучше попробовать, чем потом жалеть. Сотрудничайте с окружающими и делитесь информацией. Окружение может научить вас многому. Будьте честны и надежны в своих обещаниях.Общайтесь с лучшими из лучших. Окружайте себя успешными людьми, которые вдохновят вас и поддержат на пути к успеху. Идите за мечтой. Не бойтесь ошибок и трудностей. Будьте верны своим желаниям и не сворачивайте с пути. Сохраняйте порядок и будьте организованными.

Вы сможете не только достичь успеха, но и получать удовольствие от каждого шага на этом пути. «Секретов успеха не существует. Это результат подготовки, тяжёлой работы и извлечения уроков из неудач» (Колин Пауэлл).'''
text_success = [text_success_1]
image_success = '965417/b89d0aa8a042e5a0b7ed'

text_situation_afraid_1 = '''Чтобы справиться со страхом, важно признать, что игнорирование только усиливает его. Попробуйте прочувствовать свой страх, обсуждая его вслух или записывая на бумаге. Это поможет заменить тревожные мысли более рациональными.

Исследуйте объект своего страха, чтобы понять беспочвенность своих переживаний. Откажитесь от плохих мыслей, заменяя их позитивными. Практикуйте глубокое дыхание для успокоения и расслабления. Задавайте себе вопросы о реальности угрозы и действиях для предотвращения плохого развития событий. Продумайте план действий на случай, если страх сбудется, чтобы почувствовать себя увереннее. Чаще практикуйтесь в взаимодействии с объектом страха, постепенно увеличивая контакт. Найдите группу людей, которые уже преодолели подобные страхи.

Помните, что страх можно преодолеть, практикуйте эти методы, и вы заметите, что страх отступил! Удачи! ''Паникует ли Джейсон Стэтхем? Нет, я не паникую, но каждый день я испытываю страх по самым разным причинам. Он мотивирует меня.'' (Джейсон Стэтхем).'''
text_situation_afraid = [text_situation_afraid_1]
image_situation_afraid = '1652229/98b8086a9352e8795581'

text_time_menegement_1 = '''Здравствуйте! Вопрос о том, как успевать всё и находить время для личной жизни и отдыха, очень актуален. Вот несколько советов, которые могут помочь:

Приоритизация задач: Определите, что для вас наиболее важно. Используйте метод «матрицы Эйзенхауэра» для разделения задач на важные и срочные.
Планирование: Составьте расписание на день или неделю. Выделите время для работы, отдыха и личной жизни. Используйте календари или планировщики.
Тайм-менеджмент: Используйте техники управления временем, такие как метод "Помидора", который предполагает увеличение эффективности работы за счёт концентрации и коротких перерывов.
Забота о себе: Уделяйте время для физической активности, медитации или хобби. Это поможет вам снизить уровень стресса и улучшить общее самочувствие.
Прокрастинация: Возможно вы ничего не успеваете, возможно потому что тратите свободное время впустую или прокрастинируете

Важно помнить, что иногда нужно экспериментировать, чтобы понять, что работает именно для вас.'''
text_time_menegement = [text_time_menegement_1]
image_time_menegement = '213044/6794e11023ef517e7966'
button_time_menegement_1 = 'Зачем физическая активность?'
button_time_menegement_2 = 'Подробнее об прокрастинации и пустой траты времени'
button_time_menegement_3 = 'Подробнее про метод «матрицы Эйзенхауэра»'
button_time_menegement_4 = 'Подробнее про метод "Помидора"'
buttons_time_menegement = [button_time_menegement_1, button_time_menegement_2, button_time_menegement_3, button_time_menegement_4]


text_answer_1 = '''Когда чувствуешь, что застопорился с какой-то задачей, переключись на другую, можешь попробовать сделать зарядку или почитать книжку.
Главное помните: «Хорошо отдохнувшие разум и тело лучше справляются с трудностями, которые встречаются на вашем пути»'''

text_answer_2 = '''Когда знаешь, что ты всё делаешь не зря проще начать что-то делать'''

text_answer_3 = '''Если дел накопилось много, не спешите набрасываться на самые сложные из них. Сперва разберитесь с простыми задачами, которые требуют минимум внимания. Так вы разогреетесь и подготовитесь к более сложным делам.
И помните слова Джима Рона: «Если вы работаете над поставленными целями, то эти цели будут работать на вас.»'''

answer_time_menegement_1 = '''Например потому что отсутствие физической активности или сидячий образ жизни просто сильно негативно влияет на весь организм, потому что например люди с инвалидностью из-за того, что постоянно сидят, они сильно раньше умирают, чем обычные люди и учёные установили, что причина в именно в сидячем образе жизни.
Ещё например потому что уже много раз было проверено, что даже простая прогулка на час улучшает эмоциональное состояние и позволяет избавиться от негативных мыслей, а также успокаивает.
Также в процессе занятий спортом в организме активно выделяются вещества, поднимающие настроение. Ежедневная тридцатиминутная физическая активность позволяет снизить уровень стресса и чувствовать себя спокойнее в течение нескольких часов после тренировки.'''

answer_time_menegement_2 = '''Возможно вам просто стоило задуматься о том, что когда вы просто листаете ленту в соц. сетях, то вы и не отдыхаете и не занимаетесь полезными делами и потому стоит определиться, отдыхать или работать.
Потому что из-за такого времяпрепровождения вы и не замечаете, как проходит время и не можете вспомнить, на что потратили время. Можно вести дневник и записывать то, как провели день и на что он ушёл. Можно даже фиксировать так каждый час и возможно вы заметете, куда уходило время.
Если вам нужно работать, а вы всё время на чтото отвлекаетесь (То есть прокрастинируете) , то возможно это сигнал, что вы устали и потому стоит попробовать поставить таймер на минут 10 и забыть о работе, а после этого таймера вернуться и сконцентрироваться. Также не забывайте проветривать помещение и пить воду, чтобы мозг лучше работал.'''

answer_time_menegement_3 = '''Попробуйте нарисовать таблицу 2 на 2 и обозначить два столбца, как "Срочное" и "Несрочное" и строки, как "Важное" и "Неважное". Расставьте свои дела по приоритетам в эту таблицу из четырёх квадратов, чтобы вам наглядно было видно и понятно, на что стоит обратить большее внимание, а на что пока не стоит тратить время.
Составьте список задач. Запишите все дела, которые вам необходимо выполнить.
Распределите задачи по квадрантам. Оцените каждую задачу по критериям важности и срочности и разместите их в соответствующих квадрантах.
Планируйте свое время. Начните с выполнения задач из первого квадранта, затем переходите ко второму, третьему и, наконец, четвертому.
Регулярно пересматривайте свои задачи. Периодически обновляйте свою матрицу, чтобы учитывать новые задачи и изменения в приоритетах.

«У меня есть два типа проблем: срочные и важные. Срочные не важны, а важные — всегда несрочные», — Дуайт Эйзенхауэр.'''

answer_time_menegement_4 = '''Выберите задачу: Определите, над чем вы хотите работать.
Настройте таймер: Установите таймер на 25 минут и начните работать.
Работайте без перерывов: Сосредоточьтесь на задаче до тех пор, пока таймер не прозвонит. Если вас отвлекают, запишите отвлекающую мысль и продолжайте работать.
Сделайте короткий перерыв: После завершения 25 минут сделайте 5-минутный перерыв. Встаньте, потянитесь или выполните другую активность, чтобы отвлечься.
Повторяйте: Повторите цикл, работая в течение четырех «помидоров», а затем сделайте более длительный перерыв.

Метод Помодоро можно адаптировать под свои нужды, изменяя длительность интервалов или перерывов, в зависимости от ваших предпочтений и типа выполняемой работы.'''


intent_situations = {
    'welcome': {'text': text_welcome, 'image': image_welcome, 'buttons': buttons_welcome},
    'description': {'text': text_description, 'image': image_description, 'buttons': None},
    'no_motivation': {'text': text_no_motivation, 'image': image_no_motivation, 'buttons': buttons_no_motivation},
    'fear_scene': {'text': text_scene, 'image': image_scene, 'buttons': None},
    'stress': {'text': text_stress, 'image': image_stress, 'buttons': None},
    'sad_situation': {'text': text_sad_situation, 'image': image_sad_situation, 'buttons': None},
    'all_annoing': {'text': text_all_annoing, 'image': image_all_annoing, 'buttons': None},
    'loss_of_inspiration': {'text': text_loss_of_inspiration, 'image': image_loss_of_inspiration, 'buttons': None},
    'interesting_fact': {'text': text_interesting_fact, 'image': image_interesting_fact, 'buttons': None},
    'all_good': {'text': text_all_good, 'image': image_all_good, 'buttons': None},
    'confidence': {'text': text_confidence, 'image': image_confidence, 'buttons': None},
    'low_self_esteem': {'text': text_low_self_esteem, 'image': image_low_self_esteem, 'buttons': None},
    'success': {'text': text_success, 'image': image_success, 'buttons': None},
    'situation_afraid': {'text': text_situation_afraid, 'image': image_situation_afraid, 'buttons': None},
    'time_menegement': {'text': text_time_menegement, 'image': image_time_menegement, 'buttons': buttons_time_menegement}
}

answer_button = {
    button_1: {'text': text_answer_1, 'image': None},
    button_2: {'text': text_answer_2, 'image': None},
    button_3: {'text': text_answer_3, 'image': None},
    button_time_menegement_1: {'text': answer_time_menegement_1, 'image': None},
    button_time_menegement_2: {'text': answer_time_menegement_2, 'image': None},
    button_time_menegement_3: {'text': answer_time_menegement_3, 'image': None},
    button_time_menegement_4: {'text': answer_time_menegement_4, 'image': None},
    button_description: {'text': text_description_1, 'image': image_description},
    button_interesting_fact: {'text': text_interesting_fact_1, 'image': image_interesting_fact}
}
